DataProcessors/ВводПоказанийПриборов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ВводПоказанийПриборов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПоказания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЕксель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТабличнаяЧасть</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поверка1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледПоверка1</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холодна1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гаряча1</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поверка2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледПоверка2</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холодна2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гаряча2</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поверка3</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледПоверка3</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холодна3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гаряча3</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поверка4</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледПоверка4</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холодна4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гаряча4</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПрибора5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поверка5</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СледПоверка5</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПломбы5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Холодна5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гаряча5</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ЛицевыеСчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ЛицевыеСчета</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПрописанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПроживающих</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/УстановленныеПриборыУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>УстановленныеПриборыУчета</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СреднемесячноеПоказание</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>МестоРазмещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПрибора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСледующейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнейПоверки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектУстановки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриборыУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ВводПоказанийПриборов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Путь = Объект.ФайлЕксель;
	Если НЕ ЗначениеЗаполнено(Объект.ФайлЕксель) Тогда
		Сообщить(НСтр("ru='Укажите путь к файлу.';uk='Вкажіть шлях до файлу.'"));
		Возврат;
	КонецЕсли;
    Если Объект.ТабличнаяЧасть.Количество() > 0 Тогда
		Ответ = Вопрос(НСтр("ru='Табличная часть будет очищена! Продолжить выполнение операции?';uk='Таблична частина буде очищена! Продовжити виконання операції'"), РежимДиалогаВопрос.ДаНет, 0);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли; 
	КонецЕсли;
	Объект.ТабличнаяЧасть.Очистить();
	Попытка
		Excel = Новый COMОбъект("Excel.application");	
	Исключение
		Сообщить(НСтр("ru='Не удалось подключиться';uk='Не вдалося підключитися'") + информацияОбОшибке());
		Возврат;
	КонецПопытки;
	Excel.Workbooks.Open(Путь);
	Sheet = Excel.Sheets(1);
	Sheet = Excel.ActiveWorkbook;
	КоличествоСтрок = Excel.ActiveSheet.UsedRange.Rows.Count();//Excel.Cells.CurrentRegion.Rows.Count;
	Для Счетчик = 2 По КоличествоСтрок Цикл
		НоваяСтрока                           = Объект.ТабличнаяЧасть.Добавить();
		НоваяСтрока.ЛицевойСчет               = Excel.Cells(Счетчик, 1).Value;
		НоваяСтрока.Размещение1               = Excel.Cells(Счетчик, 2).Value;
		НоваяСтрока.НомерПрибора1             = Excel.Cells(Счетчик, 3).Value;
		НоваяСтрока.Поверка1                  = Excel.Cells(Счетчик, 4).Value;
		НоваяСтрока.СледПоверка1              = Excel.Cells(Счетчик, 5).Value;
		НоваяСтрока.НомерПломбы1              = Excel.Cells(Счетчик, 6).Value;
		НоваяСтрока.Показатель1               = Excel.Cells(Счетчик, 7).Value;
		НоваяСтрока.Холодна1                  = Excel.Cells(Счетчик, 8).Value;
		НоваяСтрока.Гаряча1                   = Excel.Cells(Счетчик, 9).Value;
		
		НоваяСтрока.Размещение2               = Excel.Cells(Счетчик, 10).Value;
		НоваяСтрока.НомерПрибора2             = Excel.Cells(Счетчик, 11).Value;
		НоваяСтрока.Поверка2                  = Excel.Cells(Счетчик, 12).Value;
		НоваяСтрока.СледПоверка2              = Excel.Cells(Счетчик, 13).Value;
		НоваяСтрока.НомерПломбы2              = Excel.Cells(Счетчик, 14).Value;
		НоваяСтрока.Показатель2               = Excel.Cells(Счетчик, 15).Value;
		НоваяСтрока.Холодна2                  = Excel.Cells(Счетчик, 16).Value;
		НоваяСтрока.Гаряча2                   = Excel.Cells(Счетчик, 17).Value;
		
		НоваяСтрока.Размещение3               = Excel.Cells(Счетчик, 18).Value;
		НоваяСтрока.НомерПрибора3             = Excel.Cells(Счетчик, 19).Value;
		НоваяСтрока.Поверка3                  = Excel.Cells(Счетчик, 20).Value;
		НоваяСтрока.СледПоверка3              = Excel.Cells(Счетчик, 21).Value;
		НоваяСтрока.НомерПломбы3              = Excel.Cells(Счетчик, 22).Value;
		НоваяСтрока.Показатель3               = Excel.Cells(Счетчик, 23).Value;
		НоваяСтрока.Холодна3                  = Excel.Cells(Счетчик, 24).Value;
		НоваяСтрока.Гаряча3                   = Excel.Cells(Счетчик, 25).Value;
		
		НоваяСтрока.Размещение4               = Excel.Cells(Счетчик, 26).Value;
		НоваяСтрока.НомерПрибора4             = Excel.Cells(Счетчик, 27).Value;
		НоваяСтрока.Поверка4                  = Excel.Cells(Счетчик, 28).Value;
		НоваяСтрока.СледПоверка4              = Excel.Cells(Счетчик, 29).Value;
		НоваяСтрока.НомерПломбы4              = Excel.Cells(Счетчик, 30).Value;
		НоваяСтрока.Показатель4               = Excel.Cells(Счетчик, 31).Value;
		НоваяСтрока.Холодна4                  = Excel.Cells(Счетчик, 32).Value;
		НоваяСтрока.Гаряча4                   = Excel.Cells(Счетчик, 33).Value;
		
        НоваяСтрока.Размещение5               = Excel.Cells(Счетчик, 34).Value;
		НоваяСтрока.НомерПрибора5             = Excel.Cells(Счетчик, 35).Value;
		НоваяСтрока.Поверка5                  = Excel.Cells(Счетчик, 36).Value;
		НоваяСтрока.СледПоверка5              = Excel.Cells(Счетчик, 37).Value;
		НоваяСтрока.НомерПломбы5              = Excel.Cells(Счетчик, 38).Value;
		НоваяСтрока.Показатель5               = Excel.Cells(Счетчик, 39).Value;
		НоваяСтрока.Холодна5                  = Excel.Cells(Счетчик, 40).Value;
		НоваяСтрока.Гаряча5                   = Excel.Cells(Счетчик, 41).Value;
	КонецЦикла;
	Excel.Workbooks.Close();
	Excel.Quit();

КонецПроцедуры

&НаКлиенте
Процедура ФайлЕксельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = Объект.ФайлЕксель;
	Фильтр = "Электронная таблица Excel(*.xlsx)|*.xlsx";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = НСтр("ru='Выберите файл';uk='Виберіть файл'");
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		Объект.ФайлЕксель = ДиалогОткрытияФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПоказанияНаСервере1()
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		ЛицевойСчет = ПолучитьЛицевыеСчета(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		ПриборыУчета = НайтиПриборУчета(ЛицевойСчет); 
		// Счетчик 1
		Если стр.Холодна1 = "Так" И стр.Гаряча1 = "Ні" Тогда
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора1).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель1;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		ИначеЕсли стр.Холодна1 = "Ні" И стр.Гаряча1 = "Так" Тогда 
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора1).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель1;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		КонецЕсли;	
		// Счетчик 2
		Если стр.Холодна2 = "Так" И стр.Гаряча2 = "Ні" Тогда
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора2).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель2;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		ИначеЕсли стр.Холодна2 = "Ні" И стр.Гаряча2 = "Так" Тогда 
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора2).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель2;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		КонецЕсли;
		// Счетчик 3
		Если стр.Холодна3 = "Так" И стр.Гаряча3 = "Ні" Тогда
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора3).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель3;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		ИначеЕсли стр.Холодна3 = "Ні" И стр.Гаряча3 = "Так" Тогда 
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора3).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель3;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		КонецЕсли;
		// Счетчик 4
		Если стр.Холодна4 = "Так" И стр.Гаряча4 = "Ні" Тогда
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора4).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель4;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		ИначеЕсли стр.Холодна4 = "Ні" И стр.Гаряча4 = "Так" Тогда 
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора4).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель4;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		КонецЕсли;
		// Счетчик 5
		Если стр.Холодна5 = "Так" И стр.Гаряча5 = "Ні" Тогда
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора5).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель5;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		ИначеЕсли стр.Холодна5 = "Ні" И стр.Гаряча5 = "Так" Тогда 
			Попытка
			    ДокУПУ = НайтиДокУПУ(ЛицевойСчет, стр.НомерПрибора5).ПолучитьОбъект();
			Исключение
				Сообщить("Не удалось получить документ ЛС: " + ЛицевойСчет);
			КонецПопытки;
			Для Каждого стрУП Из ДокУПУ.ПриборыУчета Цикл
				стрУП.НачальноеПоказание   = стр.Показатель5;
			КонецЦикла;
			Попытка
			    ДокУПУ.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				Сообщить("Не удалось провести документ ""Управление приборами №" + ДокУПУ.Номер);
			    ДокУПУ.Записать();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПоказанияНаСервере()
	Для Каждого стр Из Объект.ТабличнаяЧасть Цикл
		ЛицевойСчет = ПолучитьЛицевыеСчета(СтрЗаменить(Строка(стр.ЛицевойСчет), Символы.НПП, ""));
		Если НЕ ЗначениеЗаполнено(ЛицевойСчет) Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = НСтр("ru = 'Не удалось найти ЛС '; uk = 'Не вдалося знайти ОР '") + стр.ЛицевойСчет; 
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		Если ЗначениеЗаполнено(стр.Размещение1) Тогда
		    ПриборУчета = ПолучитьПриборыУчета(СтрЗаменить(Строка(стр.НомерПрибора1), Символы.НПП, ""), ЛицевойСчет);
			Если ПриборУчета = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
			    Сообщение.Текст = НСтр("ru = 'Не удалось найти прибор учета 1 ЛС '; uk = 'Не вдалося знайти прилад обліку 1 ОР '") + стр.ЛицевойСчет; 
			    Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокУпрПриборами = ПриборУчета.ПолучитьОбъект();
			Для Каждого стрПриборы Из ДокУпрПриборами.ПриборыУчета Цикл
				стрПриборы.НачальноеПоказание = Число(стр.Показатель1);
			КонецЦикла;
			Попытка
				ДокУпрПриборами.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокУпрПриборами.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокУпрПриборами.Номер; 
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		
		// Прибор №2
		Если ЗначениеЗаполнено(стр.Размещение2) Тогда
		    ПриборУчета = ПолучитьПриборыУчета(СтрЗаменить(Строка(стр.НомерПрибора2), Символы.НПП, ""), ЛицевойСчет);
			Если ПриборУчета = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
			    Сообщение.Текст = НСтр("ru = 'Не удалось найти прибор учета 2 ЛС '; uk = 'Не вдалося знайти прилад обліку 2 ОР '") + стр.ЛицевойСчет; 
			    Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокУпрПриборами = ПриборУчета.ПолучитьОбъект();
			Для Каждого стрПриборы Из ДокУпрПриборами.ПриборыУчета Цикл
				стрПриборы.НачальноеПоказание = Число(стр.Показатель2);
			КонецЦикла;
			Попытка
				ДокУпрПриборами.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокУпрПриборами.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокУпрПриборами.Номер; 
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		
		// Прибор №3
		Если ЗначениеЗаполнено(стр.Размещение3) Тогда
		    ПриборУчета = ПолучитьПриборыУчета(СтрЗаменить(Строка(стр.НомерПрибора3), Символы.НПП, ""), ЛицевойСчет);
			Если ПриборУчета = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
			    Сообщение.Текст = НСтр("ru = 'Не удалось найти прибор учета 3 ЛС '; uk = 'Не вдалося знайти прилад обліку 3 ОР '") + стр.ЛицевойСчет; 
			    Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокУпрПриборами = ПриборУчета.ПолучитьОбъект();
			Для Каждого стрПриборы Из ДокУпрПриборами.ПриборыУчета Цикл
				стрПриборы.НачальноеПоказание = Число(стр.Показатель3);
			КонецЦикла;
			Попытка
				ДокУпрПриборами.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокУпрПриборами.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокУпрПриборами.Номер; 
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		
		// Прибор №4
		Если ЗначениеЗаполнено(стр.Размещение4) Тогда
		    ПриборУчета = ПолучитьПриборыУчета(СтрЗаменить(Строка(стр.НомерПрибора4), Символы.НПП, ""), ЛицевойСчет);
			Если ПриборУчета = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
			    Сообщение.Текст = НСтр("ru = 'Не удалось найти прибор учета 4 ЛС '; uk = 'Не вдалося знайти прилад обліку 4 ОР '") + стр.ЛицевойСчет; 
			    Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокУпрПриборами = ПриборУчета.ПолучитьОбъект();
			Для Каждого стрПриборы Из ДокУпрПриборами.ПриборыУчета Цикл
				стрПриборы.НачальноеПоказание = Число(стр.Показатель4);
			КонецЦикла;
			Попытка
				ДокУпрПриборами.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокУпрПриборами.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокУпрПриборами.Номер; 
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
		
		// Прибор №5
		Если ЗначениеЗаполнено(стр.Размещение5) Тогда
		    ПриборУчета = ПолучитьПриборыУчета(СтрЗаменить(Строка(стр.НомерПрибора5), Символы.НПП, ""), ЛицевойСчет);
			Если ПриборУчета = Неопределено Тогда
				Сообщение = Новый СообщениеПользователю;
			    Сообщение.Текст = НСтр("ru = 'Не удалось найти прибор учета 5 ЛС '; uk = 'Не вдалося знайти прилад обліку 5 ОР '") + стр.ЛицевойСчет; 
			    Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			ДокУпрПриборами = ПриборУчета.ПолучитьОбъект();
			Для Каждого стрПриборы Из ДокУпрПриборами.ПриборыУчета Цикл
				стрПриборы.НачальноеПоказание = Число(стр.Показатель5);
			КонецЦикла;
			Попытка
				ДокУпрПриборами.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
			Исключение
				ДокУпрПриборами.Записать();
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = НСтр("ru = 'Не удалось провести докмент '; uk = 'Не вдалося провести документ '") + ДокУпрПриборами.Номер; 
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьПоказания(Команда)
	ЗаписатьПоказанияНаСервере();
КонецПроцедуры




////////////////////////////////////////////////////////////////////////////////////////
&НаСервере
Функция ПолучитьЛицевыеСчета(ЛицевойСчет)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	ЛицевыеСчетаСрезПоследних.ЛицевойСчет КАК Ссылка
	    |ИЗ
	    |	РегистрСведений.ЛицевыеСчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ЛицевойСчет.Наименование = &Наименование) КАК ЛицевыеСчетаСрезПоследних";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Наименование", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЛС = Выборка.Ссылка;
	КонецЦикла;
	Возврат ЛС;
КонецФункции

&НаСервере
Функция НайтиПриборУчета(ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета.ЗаводскойНомер КАК НомерПрибора
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			Действует = ИСТИНА
	    |				И ОбъектУстановки = &ОбъектУстановки) КАК УстановленныеПриборыУчетаСрезПоследних";
    Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	ПУ = Новый Структура;
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПУ.Вставить("ПриборУчета", Выборка.ПриборУчета);
		ПУ.Вставить("НомерПрибора", Выборка.НомерПрибора);
	КонецЦикла;
	Возврат ПУ;
КонецФункции

&НаСервере
Функция НайтиДокУПУ(ЛицевойСчет, НомерПрибора)
    Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УправлениеПриборамиУчетаПриборыУчета.Ссылка.Ссылка КАК Ссылка
	    |ИЗ
	    |	Документ.УправлениеПриборамиУчета.ПриборыУчета КАК УправлениеПриборамиУчетаПриборыУчета
	    |ГДЕ
	    |	УправлениеПриборамиУчетаПриборыУчета.ПриборУчета.ЗаводскойНомер = &ЗаводскойНомер
	    |	И УправлениеПриборамиУчетаПриборыУчета.Ссылка.ОбъектУстановки = &ОбъектУстановки
	    |	И УправлениеПриборамиУчетаПриборыУчета.Ссылка.Проведен = ИСТИНА";
	Запрос.УстановитьПараметр("ЗаводскойНомер", НомерПрибора);
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Док = Выборка.Ссылка;
	КонецЦикла;
	Возврат Док;
КонецФункции

&НаСервере
Функция ПолучитьПриборыУчета(НомерПрибора, ЛицевойСчет)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	УстановленныеПриборыУчетаСрезПоследних.ПриборУчета КАК ПриборУчета,
	    |	ПоказанияПриборовУчетаСрезПоследних.Значение,
	    |	ПоказанияПриборовУчетаСрезПоследних.Регистратор КАК ДокументУП
	    |ИЗ
	    |	РегистрСведений.УстановленныеПриборыУчета.СрезПоследних(
	    |			&НаДату,
	    |			ПриборУчета.ЗаводскойНомер = &ЗаводскойНомер
	    |				И Действует = ИСТИНА) КАК УстановленныеПриборыУчетаСрезПоследних
	    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоказанияПриборовУчета.СрезПоследних(
	    |				&НаДату,
	    |				ПриборУчета.ЗаводскойНомер = &ЗаводскойНомер
	    |					И Отключен = ЛОЖЬ) КАК ПоказанияПриборовУчетаСрезПоследних
	    |		ПО УстановленныеПриборыУчетаСрезПоследних.ПриборУчета = ПоказанияПриборовУчетаСрезПоследних.ПриборУчета
	    |ГДЕ
	    |	УстановленныеПриборыУчетаСрезПоследних.ОбъектУстановки = &ОбъектУстановки
	    |	И УстановленныеПриборыУчетаСрезПоследних.Регистратор.ВидОперации = &ВидОперации";
	Запрос.УстановитьПараметр("НаДату", Новый Граница(ТекущаяДата(), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ЗаводскойНомер", НомерПрибора);
	Запрос.УстановитьПараметр("ОбъектУстановки", ЛицевойСчет);
	Запрос.УстановитьПараметр("ВидОперации", Перечисления.ВидыОперацийУправленияПриборамиУчета.УстановкаПрибораУчета);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	//Прибор = Новый Структура();
	Пока Выборка.Следующий() Цикл
		Прибор = Выборка.ДокументУП;
		//Прибор.Вставить("ПриборУчета",Выборка.ПриборУчета);
		//Прибор.Вставить("ПредыдущееЗначение", Выборка.Значение);
	КонецЦикла;
	Возврат Прибор;
КонецФункции
